<?php

class Solution {

    /**
     * 2914. Мінімальна кількість змін, щоб зробити бінарний рядок красивим

        Вам дано двійковий рядок S з індексом 0, що має парну довжину.

        Рядок красивий, якщо його можна розбити на один або кілька підрядків таким чином, щоб:

        Кожна підрядок мав парну довжину.
        Кожен підрядок містить лише 1 або лише 0.
        Ви можете змінити будь-який символ у рядку s на 0 або 1.

        Повернути мінімальну кількість змін, необхідних для надання рядку s красивого вигляду.

        https://leetcode.com/problems/minimum-number-of-changes-to-make-binary-string-beautiful/

     * @param String $s
     * @return Integer
     */
    function minChanges($s) {
        $changes = 0;
        for ($i=0;$i<strlen($s);$i+=2) {
            $changes += ($s[$i] !== $s[$i+1]);
        }
        return $changes;
    }
}